
#Область ПрограммныйИнтерфейс

&После("ТабельДанныеОВремениВремяПредставлениеОбработкаВыбора")
Процедура КРВС_ТабельДанныеОВремениВремяПредставлениеОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда      
		
		НомерДня = УчетРабочегоВремениРасширенныйКлиентСервер.ТабельНомерДняПоИмениЭлемента(Элемент.Имя);
		ДанныеТекущейСтроки = Форма.Элементы.ДанныеОВремени.ТекущиеДанные;
		КРВС_КонтрольРабочегоВремениСотрудниковКлиентСервер.РассчитатьНеобоснованныеЧасыОтсутствияСотрудника(Форма.Объект, ДанныеТекущейСтроки.Сотрудник, НомерДня);			

	КонецЕсли;
		
КонецПроцедуры

&После("ТабельДанныеОВремениПередОкончаниемРедактирования")
Процедура КРВС_ТабельДанныеОВремениПередОкончаниемРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	СотрудникиКОтбору = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элемент.ТекущиеДанные.Сотрудник);
	КРВС_КонтрольРабочегоВремениСотрудниковКлиентСервер.ЗаполнитьИтогиНеобоснованныхОтсутствийПоСотрудникам(Форма.Объект, СотрудникиКОтбору);

КонецПроцедуры

#КонецОбласти

